; domain
(define (domain logistics-strips)
  (:requirements :strips)
  (:types OBJ TRUCK LOCATION AIRPLANE AIRPLANE_ACCESS0 AIRPLANE_ACCESS1 AIRPLANE_ACCESS2 AIRPLANE_ACCESS3 AIRPORT_ACCESS0 AIRPORT_ACCESS1 AIRPORT_ACCESS2 AIRPORT_ACCESS3- object)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
        (AIRPLANE ?airplane)
		(AIRPLANE_ACCESS0 ?airplane)
		(AIRPLANE_ACCESS1 ?airplane)
		(AIRPLANE_ACCESS2 ?airplane)
		(AIRPLANE_ACCESS3 ?airplane)
                (CITY ?city)
                (AIRPORT_ACCESS0 ?airport)
                (AIRPORT_ACCESS1 ?airport)
                (AIRPORT_ACCESS2 ?airport)
                (AIRPORT_ACCESS3 ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

; #<class 'tuple'>: ('drive-truck_t1_l12_l10_c1', 'load-truck_p0_t1_l10', 'drive-truck_t1_l10_l11_c1', 'unload-truck_p0_t1_l11')

(:action LOAD-TRUCK
  :parameters
   (?obj - OBJ
    ?truck - TRUCK
    ?loc - LOCATION )
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj - OBJ
    ?airplane - AIRPLANE
    ?loc - LOCATION )
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - OBJ
    ?truck - TRUCK
    ?loc - LOCATION)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj - OBJ
    ?airplane - AIRPLANE
    ?loc - LOCATION )
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - TRUCK
    ?loc-from - LOCATION
    ?loc-to - LOCATION
    ?city - CITY )
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

;=======================================================
; The different fly actions for different access regions

(:action FLY-AIRPLANE_ACCESS0
  :parameters
   (?airplane - AIRPLANE_ACCESS0
    ?loc-from - AIRPORT_ACCESS0
    ?loc-to - AIRPORT_ACCESS0 )
  :precondition
   (and (AIRPLANE_ACCESS0 ?airplane) (AIRPORT_ACCESS0 ?loc-from) (AIRPORT_ACCESS0 ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))

(:action FLY-AIRPLANE_ACCESS1
  :parameters
   (?airplane - AIRPLANE_ACCESS1
    ?loc-from - AIRPORT_ACCESS1
    ?loc-to - AIRPORT_ACCESS1 )
  :precondition
   (and (AIRPLANE_ACCESS1 ?airplane) (AIRPORT_ACCESS1 ?loc-from) (AIRPORT_ACCESS1 ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))


(:action FLY-AIRPLANE_ACCESS2
  :parameters
   (?airplane - AIRPLANE_ACCESS2
    ?loc-from - AIRPORT_ACCESS2
    ?loc-to - AIRPORT_ACCESS2 )
  :precondition
   (and (AIRPLANE_ACCESS2 ?airplane) (AIRPORT_ACCESS2 ?loc-from) (AIRPORT_ACCESS2 ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))


(:action FLY-AIRPLANE_ACCESS3
  :parameters
   (?airplane - AIRPLANE_ACCESS3
    ?loc-from - AIRPORT_ACCESS3
    ?loc-to - AIRPORT_ACCESS3 )
  :precondition
   (and (AIRPLANE_ACCESS3 ?airplane) (AIRPORT_ACCESS3 ?loc-from) (AIRPORT_ACCESS3 ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))


) ; END OF DOMAIN FILE

; problem
(define (problem logistics-c8-s4-p1-a4)
(:domain logistics-strips)
(:objects a0 a1 a2 a3 
          c0 c1 c2 c3 c4 c5 c6 c7 
          t0 t1 t2 t3 t4 t5 t6 t7 
          l00 l01 l02 l03 l10 l11 l12 l13 l20 l21 l22 l23 l30 l31 l32 l33 l40 l41 l42 l43 l50 l51 l52 l53 l60 l61 l62 l63 l70 l71 l72 l73 
          p0 
)
; The major modification is that the airplanes are both regular airplanes (for loading and unloading) as well as special airplanes for accessing specific
; subset of cities. This separates the cities.

(:init
(AIRPLANE a0)
(AIRPLANE a1)
(AIRPLANE a2)
(AIRPLANE a3)
(AIRPLANE_ACCESS0 a0)
(AIRPLANE_ACCESS1 a1)
(AIRPLANE_ACCESS2 a2)
(AIRPLANE_ACCESS3 a3)
(CITY c0)
(CITY c1)
(CITY c2)
(CITY c3)
(CITY c4)
(CITY c5)
(CITY c6)
(CITY c7)
(TRUCK t0)
(TRUCK t1)
(TRUCK t2)
(TRUCK t3)
(TRUCK t4)
(TRUCK t5)
(TRUCK t6)
(TRUCK t7)
(LOCATION l00)
(in-city  l00 c0)
(LOCATION l01)
(in-city  l01 c0)
(LOCATION l02)
(in-city  l02 c0)
(LOCATION l03)
(in-city  l03 c0)
(LOCATION l10)
(in-city  l10 c1)
(LOCATION l11)
(in-city  l11 c1)
(LOCATION l12)
(in-city  l12 c1)
(LOCATION l13)
(in-city  l13 c1)
(LOCATION l20)
(in-city  l20 c2)
(LOCATION l21)
(in-city  l21 c2)
(LOCATION l22)
(in-city  l22 c2)
(LOCATION l23)
(in-city  l23 c2)
(LOCATION l30)
(in-city  l30 c3)
(LOCATION l31)
(in-city  l31 c3)
(LOCATION l32)
(in-city  l32 c3)
(LOCATION l33)
(in-city  l33 c3)
(LOCATION l40)
(in-city  l40 c4)
(LOCATION l41)
(in-city  l41 c4)
(LOCATION l42)
(in-city  l42 c4)
(LOCATION l43)
(in-city  l43 c4)
(LOCATION l50)
(in-city  l50 c5)
(LOCATION l51)
(in-city  l51 c5)
(LOCATION l52)
(in-city  l52 c5)
(LOCATION l53)
(in-city  l53 c5)
(LOCATION l60)
(in-city  l60 c6)
(LOCATION l61)
(in-city  l61 c6)
(LOCATION l62)
(in-city  l62 c6)
(LOCATION l63)
(in-city  l63 c6)
(LOCATION l70)
(in-city  l70 c7)
(LOCATION l71)
(in-city  l71 c7)
(LOCATION l72)
(in-city  l72 c7)
(LOCATION l73)
(in-city  l73 c7)
(AIRPORT_ACCESS0 l00)
(AIRPORT_ACCESS0 l10)
(AIRPORT_ACCESS0 l20)
(AIRPORT_ACCESS0 l30)

(AIRPORT_ACCESS1 l33)
(AIRPORT_ACCESS1 l43)

(AIRPORT_ACCESS2 l40)
(AIRPORT_ACCESS2 l50)
(AIRPORT_ACCESS2 l60)

(AIRPORT_ACCESS3 l53)
(AIRPORT_ACCESS3 l63)
(AIRPORT_ACCESS3 l70)
(OBJ p0)
(at t0 l01)
(at t1 l11)
(at t2 l22)
(at t3 l31)
(at t4 l42)
(at t5 l50)
(at t6 l60)
(at t7 l70)
(at p0 l02)
(at a0 l10)
(at a1 l33)
(at a2 l60)
(at a3 l63)
)
(:goal
(and
(at p0 l73)
)
)
)

; plan
1. (drive-truck t4 l42 l43 c4)
   deleted: (at t4 l42)
   added: (at t4 l43)
   goals met: 0 of 1
2. (drive-truck t3 l31 l30 c3)
   deleted: (at t3 l31)
   added: (at t3 l30)
   goals met: 0 of 1
3. (drive-truck t0 l01 l02 c0)
   deleted: (at t0 l01)
   added: (at t0 l02)
   goals met: 0 of 1
4. (load-truck p0 t0 l02)
   deleted: (at p0 l02)
   added: (in p0 t0)
   goals met: 0 of 1
5. (drive-truck t0 l02 l00 c0)
   deleted: (at t0 l02)
   added: (at t0 l00)
   goals met: 0 of 1
6. (unload-truck p0 t0 l00)
   deleted: (in p0 t0)
   added: (at p0 l00)
   goals met: 0 of 1
7. (fly-airplane_access0 a0 l10 l00)
   deleted: (at a0 l10)
   added: (at a0 l00)
   goals met: 0 of 1
8. (load-airplane p0 a0 l00)
   deleted: (at p0 l00)
   added: (in p0 a0)
   goals met: 0 of 1
9. (fly-airplane_access0 a0 l00 l30)
   deleted: (at a0 l00)
   added: (at a0 l30)
   goals met: 0 of 1
10. (unload-airplane p0 a0 l30)
   deleted: (in p0 a0)
   added: (at p0 l30)
   goals met: 0 of 1
11. (load-truck p0 t3 l30)
   deleted: (at p0 l30)
   added: (in p0 t3)
   goals met: 0 of 1
12. (drive-truck t3 l30 l33 c3)
   deleted: (at t3 l30)
   added: (at t3 l33)
   goals met: 0 of 1
13. (unload-truck p0 t3 l33)
   deleted: (in p0 t3)
   added: (at p0 l33)
   goals met: 0 of 1
14. (load-airplane p0 a1 l33)
   deleted: (at p0 l33)
   added: (in p0 a1)
   goals met: 0 of 1
15. (fly-airplane_access1 a1 l33 l43)
   deleted: (at a1 l33)
   added: (at a1 l43)
   goals met: 0 of 1
16. (unload-airplane p0 a1 l43)
   deleted: (in p0 a1)
   added: (at p0 l43)
   goals met: 0 of 1
17. (load-truck p0 t4 l43)
   deleted: (at p0 l43)
   added: (in p0 t4)
   goals met: 0 of 1
18. (drive-truck t4 l43 l40 c4)
   deleted: (at t4 l43)
   added: (at t4 l40)
   goals met: 0 of 1
19. (unload-truck p0 t4 l40)
   deleted: (in p0 t4)
   added: (at p0 l40)
   goals met: 0 of 1
20. (fly-airplane_access2 a2 l60 l40)
   deleted: (at a2 l60)
   added: (at a2 l40)
   goals met: 0 of 1
21. (load-airplane p0 a2 l40)
   deleted: (at p0 l40)
   added: (in p0 a2)
   goals met: 0 of 1
22. (fly-airplane_access2 a2 l40 l60)
   deleted: (at a2 l40)
   added: (at a2 l60)
   goals met: 0 of 1
23. (unload-airplane p0 a2 l60)
   deleted: (in p0 a2)
   added: (at p0 l60)
   goals met: 0 of 1
24. (load-truck p0 t6 l60)
   deleted: (at p0 l60)
   added: (in p0 t6)
   goals met: 0 of 1
25. (drive-truck t6 l60 l63 c6)
   deleted: (at t6 l60)
   added: (at t6 l63)
   goals met: 0 of 1
26. (unload-truck p0 t6 l63)
   deleted: (in p0 t6)
   added: (at p0 l63)
   goals met: 0 of 1
27. (load-airplane p0 a3 l63)
   deleted: (at p0 l63)
   added: (in p0 a3)
   goals met: 0 of 1
28. (fly-airplane_access3 a3 l63 l70)
   deleted: (at a3 l63)
   added: (at a3 l70)
   goals met: 0 of 1
29. (unload-airplane p0 a3 l70)
   deleted: (in p0 a3)
   added: (at p0 l70)
   goals met: 0 of 1
30. (load-truck p0 t7 l70)
   deleted: (at p0 l70)
   added: (in p0 t7)
   goals met: 0 of 1
31. (drive-truck t7 l70 l73 c7)
   deleted: (at t7 l70)
   added: (at t7 l73)
   goals met: 0 of 1
32. (unload-truck p0 t7 l73)
   deleted: (in p0 t7)
   added: (at p0 l73)
   goals met: 1 of 1
